benchmark/FieldExamples/cavityIGAFSIBenchmark/cavityFSIBenchmarkOF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 0 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 0 0)
    (0 0.9 0)
    (0 0.9 0.1)
    (1 0.9 0.1)
    (1 0.9 0)
    (0 1 0)
    (0 1 0.1)
    (1 1 0.1)
    (1 1 0)
);

blocks
(
    hex (0 3 7 4 1 2 6 5)  (30 27 1) simpleGrading (1 1 1)
    hex (4 7 11 8 5 6 10 9)(30 3  1) simpleGrading (1 1 1)
);

edges
(
);

boundary
( 
    movingWall
    {
        type wall;
        faces
        (
            (8 9 10 11)
        );
    }
    fsiWall 
    {
    	type wall;
    	faces
		(
			(0 3 2 1) 
		);   
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (1 2 6 5)
            (5 6 10 9)
        );
    }
    inlet 
    {
	 type patch;
	 faces
	 (
	   (8 4 5 9)   
	 );  
	}
	outlet	
	{
	 type patch;
	 faces
	 (
	   (11 10 6 7)   
	 );  
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
